Revit 2026 API

# ConstructionId Property

---

Get the id of the Construction.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Id { get; }
```
```vb
Public ReadOnly Property Id As String
	Get
```
```cpp
public:
property String^ Id {
	String^ get ();
}
```
```fsharp
member Id : string with get
```

#### Property Value

String

This property is used to get the id of the Construction.

#### Reference

Construction Class

Autodesk.Revit.DB Namespace